:orange_circle:
```
sudo docker compose run --rm devops-utils sh -c 'aws sts get-caller-identity'
{
    "UserId": "AROA2QIXXJAZFIC6A6JJH:arthur.nguyen@mantelgroup.com.au",
    "Account": "722141136946",
    "Arn": "arn:aws:sts::722141136946:assumed-role/AWSReservedSSO_AdministratorAccess_97de9e78ac747093/arthur.nguyen@mantelgroup.com.au"
}
sudo docker compose run --rm devops-utils sh -c 'cd components/keypair; terraform init -backend-config="bucket=devops-blog-arthur-200" -backend-config="key="infrastructure/keypair/instance-terraform.tfstate"" -backend-config="region=ap-southeast-2"'
[0m[1mInitializing modules...[0m

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/local from the dependency lock file
- Reusing previous version of hashicorp/tls from the dependency lock file
- Using previously-installed hashicorp/tls v4.1.0
- Using previously-installed hashicorp/aws v4.67.0
- Using previously-installed hashicorp/local v2.6.1

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
sudo docker compose run --rm devops-utils sh -c 'cd components/keypair; terraform plan -no-color -var-file="../../accounts/infrastructure/identity/var.tfvars"'
module.keypair.tls_private_key.ed25519-key: Refreshing state... [id=ce838c32b67337892996a9050cfd4964fa00d28a]
module.keypair.aws_key_pair.this: Refreshing state... [id=cluster-key]
module.keypair.local_sensitive_file.this: Refreshing state... [id=1f6c65abec781dd6df8207a78e46d26126d05309]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keypair.local_sensitive_file.this will be created
  + resource "local_sensitive_file" "this" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "../../modules/aws-resource/keypair/sshkey-cluster-key"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "role_name" but a value was
found in file "../../accounts/infrastructure/identity/var.tfvars". If you
meant to use this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "owner" but a value was
found in file "../../accounts/infrastructure/identity/var.tfvars". If you
meant to use this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```